import greenfoot.*;  // (World, Actor, GreenfootImage, Greenfoot and MouseInfo)

/**
 * Write a description of class CyberpunkCity here.
 * 
 * @author (your name) 
 * @version (a version number or a date)
 */
public class CyberpunkCity extends Homesick
{
    private int scene = 0;
    private Asset rocket = new Asset("rocket.png", false);
    private Asset portal = new Asset("portal.gif", true);
    private Asset cyberpunkDoor = new Asset("cyberpunkDoor.png", false);
    private Asset screen = new Asset("screen.png", false);
    private String key = "0113401134";
    private Text greentext = new Text(key, 24, Color.GREEN);
    private NPC Tod = new NPC("tod.png", 1, false);
    private NPC Rob = new NPC("rob.png", 0, false);
    private String password = "";
    private String t = "";
    private Text text = new Text("", 1, Color.BLACK);
    private int counter = 3;
    private Text counterText = new Text("You have " + counter + " remaining attempts.", 24, Color.GREEN);
    /**
     * Constructor for objects of class CityInside.
     * 
     */
    public CyberpunkCity()
    {
       drawMaterials();
       drawButtons();
       drawActors();
       drawBackground();
    }
    
    private void playMusic(){
        this.cityMusic.setVolume(VOLUME*10);
        cityMusic.playLoop();
    }
    
    public void act(){
        initialScene();
        if(Greenfoot.mouseClicked(cyberpunkDoor)) {
            showKeypad();
            scene++;
        }
        if(scene == 4) {
            t = Greenfoot.getKey();
            if(t!=null) {
                password+=t;
                removeObject(text);
                text = new Text(password, 24, Color.GREEN);
                addObject(text, MIDDLE+300, MIDDLE+80);
            }
            if(password.length() == 10) {
                if(password.equals(key)) {
                    scene++;
                } else {
                    counter--;
                    nopeWrong.setVolume(VOLUME*25);
                    nopeWrong.play();
                    removeObject(counterText);
                    counterText = new Text("You have " + counter + " remaining attempts.", 24, Color.GREEN);
                    addObject(counterText, MIDDLE+300, MIDDLE+140);
                    password = "";
                    removeObject(text);
                    text = new Text(password, 24, Color.GREEN);
                }
            }
            if (counter == 0) {
                Greenfoot.setWorld(new GameOver("the snickers\nran out."));
            }
        }
        if(scene == 5) {
            Greenfoot.delay(25);
            clink.setVolume(VOLUME*30);
            clink.play();
            Greenfoot.delay(100);
            Greenfoot.setWorld(new CityInside());
        }
    }
    
    private void showKeypad() {
        screen.scale(0.4);
        addObject(screen, MIDDLE+300, MIDDLE+170);
        addObject(greentext, MIDDLE+300, MIDDLE+50);
        addObject(counterText, MIDDLE+300, MIDDLE+140);
    }
    
    private void initialScene() {
        if(scene == 0) {
            addObject(portal, 100, 100);
            addObject(Tod, 100, 100);
            addObject(Rob, 100, 100);
            Tod.scale(0.7);
            Rob.scale(0.8);
            scene++;
        }
        if (Tod.getY() < MIDDLE+180) {
            Tod.setLocation(Tod.getX()+6, Tod.getY()+24);
        }
        if (Rob.getY() < MIDDLE+180) {
            Rob.setLocation(Rob.getX()+12, Rob.getY()+18);
        } else if(scene == 1){
            removeObject(portal);
            scene++;
        }
        if (scene == 2) {
            Greenfoot.delay(275);
            Rob.say("TOD", false, 3);
            Greenfoot.delay(100);
            Rob.stopSaying();
            Tod.say("yes", false, 1);
            Greenfoot.delay(100);
            Tod.stopSaying();
            Rob.say("*inhale*", false, 0);
            Greenfoot.delay(100);
            Rob.stopSaying();
            Rob.say("AAAAAAAAAAAAAA\nAAAAAAAAAAAAAAAA\nAAAAAAAAAAAAAAAAAAAAAAA\nAAAAAAAAAAAAAAAAAAAA\nAAAAAAAAAAAAAAAAAA", false, 3);
            Greenfoot.delay(150);
            Rob.stopSaying();
            Rob.say("THE YEAR 2000,\n TOD, 2 with THREE\n0s, NOT FOUR 0s", false, 3);
            Greenfoot.delay(200);
            Rob.stopSaying();
            Tod.say("...", false, 0);
            Greenfoot.delay(70);
            Tod.stopSaying();
            Tod.say("...You want a\nsnickers?", false, 1);
            Greenfoot.delay(250);
            Tod.stopSaying();
            Rob.say("⛧ ẗ̸̨̨̢̨̡̡̡̢̨̢̡̧̨̡̧̧̨̡̢̡̨̨̛̛̛̛̛̛̛̼̰̬̞͎̺̮̱̦̬̲͍̪͔̪̬͈̗̻̤͉͍̖̣̙̪̱͉̳̦͖̠̝̞̯͚̞̖͉͖͍̬͈͖͔̥͖̫̘̮̣̘̺͓̼̹̺͇̹͇͖̼̣͈̫̥̙͙͚̪͓͔͇̹̬͈̟̪̲̯̼̪̗̗̩̗̹̟̝̹̮̳̙̘̞͈̖̥̣̱̩͕̣̤͓̙̹̺̞̰͖̥̥̠͇̻̝͕̺͚͓̟̼̗̥͖̤̰͍̣̘̰̩̼̞̰̱̼͕̘̙̺̺̦̫̻͉̣̭̼̖̠̰͕̗̻͉̲̼̭̠̤̩͉̭̱͕͓̲̳̫̩͍̞̖͚̩̟̥̜͈͎̦̲̥̭͖̘̼̖̥̻̠̫̗̹̰͖̩̗̳̦̗͖͙̰̗̘̙̤̰͚͎̖̫̫̪̪̖̖͈̤͚̮̣͙̱̠̼̯͇̲̣̘͍͉͈̥͓͈̺̫̣̻̪̤̜̞̙̩̺̠̦̳̹̟̥́̐̒̑̀̓̌̎̍͋̋́̀͛̉͐͊́̔̀́͐̔̈́̑͐͛̉̿͒̀͂̉̓̀̎͂͑́͑̀͋̏̓̈́̔̇̽͑̈́͋̾͂̀̓̄͒̒̈̉̔͐̾͆̍̅́́̏͛̑̇̃̅̿͒͐̈̽̅̄͗̒̑̊͗͑̿͗̂̈́̇̎͊́̔́̇̄̊͊̈́̅͌͑̂̿͒̅͋̈́̈͐̽̏̀̇͑͗͋̏̈́̂̓͊͆̈̂̔͂́̓̐͆̿͒̌̌͗̏̃̀̋͂͊̅̏̂̓͛͆̽͆̍̾̏̿͛͛̒̒͆̆̓̅͆̄͒͑̀͗̿̇͆̍̈́͛͋́̀̈́͑͛̌̆́̏̃̐̌͌͐̄̀̄͒́̾̑̃̈́͂̈̂̍́̎͋̄́̔̀͐̒̉̉͋́̓̈͌͐̆̊͊̐́̚͘̕̚͘̚̚̕͘͘͘͘̕̕̚̚͘͘̕̕̚͜͜͜͜͜͜͠͝͠͝͝͝͝͝͝͠͝ͅͅͅơ̸̡̨̨̨̡̡̨̡̢̢̢̧̡̨̨̨̧̧̨̢̨̛̛̛̛̞̖̠̪̭͇̣͕̘̼̘̲̮̜̱̥̖͚̝̝̟̫͓̦͖̦̥̻͙̖̺̞̭̮̜̖̼͙̝͈̬̰̘̠̖͎͈͖͉̞̦̩̺̜̥̳̦̫͔͍͖͈̣̬̫͉̱͙̲̗͍̲̯͍̩̗̼̺͉͖̲̟̭̗̤̩̲̲̰̝̼̫̞͖͎͖̦͎̬̱̣̹̣̬͉͎͙̳͍͇̩̯̭͔͓̬̤̲̬͉̹̻͔̜̺̙͍̺̦̦̯̣̟̘̭̼̗͇̝̤͙̞̭̤̣̭͈̜̠̮̮̘̜̹̩̟̤͚̻̺̠̲̬̮̗̻̱̞͔̲̱͙̤͓̤̣̪̭̦̤̳̲͍̬͚̰̖̭͖̳̟̗̭̻̺̟̩̱̮͔̯̭̱̣̫̟͕̞͍̥͚̺̞̖͔͈̩̲͉̰̹̻̝̠̭͕͉͖̹̲̠̝̳̹̠̹̜̤̗̥̰̲̝̜̹͍͙͉̤̠͇̄́̆͌̌̿̒̐͐̽̿̉̑̔̋̆͑̓͋̈́̏́́̈́͗̿̃́̍̍͒̈͋̌͑́̐͗̾̊͒͋̾͂̇́͋̋͋̏̈́̿͑̑̈́͑̋̂͗́̂̈́̒̓͆̈̀̂͑̋͐̉̐̒̀̃̈́͗̍̂̀͆́̽̀̿͆͊̃͊̈͐̄̽̃͒́͋̍̃̉̓͑̂̌̂͑̐̒̂͆͂͆̆̅̌͊́̎̈́̏͒͊̃̈́̏̋̓̃̿͒̎́͂͐̎͛̅̑̽̈̂̉̽̄́́̊͗̿͑̒̃͂̄̏̿̀͆͂͗̓̔̒̈́̎͛͗̇́̾̓́̏̽̌͗̈́͂̈́̑̐͐͗͌̃̄̃̈́͋͋̃̏͊͆̏͑͑̈́̄̊́̅̇̍̄͐̿̇͌̄̇̂͌̈̏͒̾̈́͌̎̌̊̀̀̓̓̾̓̏̑̈́͑̌͒̏͛̚͘͘̕͘̚͘̚͘̚̚͘̚̚̚̚̕̚̚͘͘͜͜͜͜͝͝͝͝͠͝͠͠͝͝͝͝͠͝͝ͅͅd̴̨̨̧̢̢̨̢̡̧̧̡̨̧̢̢̧̡̨̻̦̥̣̞͉̟̭̺͙̥̼̜̩̻͉̜̭͚̦̝̪͕͕̻͙͎̲̘̞͕͙̟̪̞̠̖̻͕̬̖͖̤͍͖͖̮͕͖̝̩̤̯͈͖̭͓͉͙͈̱͍̥̙̬̳̠̳̫̫̤͚̺̮̪̬͖̪̜͕̣̹͓͇̙̣̩̹̥͎̜̱͇͓͖͙͕̠̠̬͙̙̯̟̠̺̭͓̰̥̬̮̻̯̻̣͔͕̥̞̙̦̞̺͖͕̬͖̪̟̞̙̖͇̺̠̥̝̙̠̝̺͎̝̹̘̩͇̭̭̻̹͉̲͍̥̼̗̤̳̣͇̼͖̯͕̘̜̭̺̪̙̠̼̥̬̩͉̲͓͎̻̺͕͙̒̐̏̆̏̏̉̇̐̉̄̈̎̾͊͌̏̿͑̀̏̓̈́̒̀͂̈́̿͐́͂͒͐̇̿̇̒̑͆̋͑̉̓̉̓͒̀̐̈́̄̈̽͋̋̔̐́̔̔̾̉̑̅͒̾͑̏̃̓̏̈́͗̾͊͑̐̾̃̋̆̈͋͋͛̾̈́̒̐̒̃̂̑̀͗̚͘͘̕̕͘͘̚͘͜͜͜͜͜͜͜͝͝͝͠͝͠͝ͅͅͅ ẗ̸̨̨̢̨̡̡̡̢̨̢̡̧̨̡̧̧̨̡̢̡̨̨̛̛̛̛̛̛̛̼̰̬̞͎̺̮̱̦̬̲͍̪͔̪̬͈̗̻̤͉͍̖̣̙̪̱͉̳̦͖̠̝̞̯͚̞̖͉͖͍̬͈͖͔̥͖̫̘̮̣̘̺͓̼̹̺͇̹͇͖̼̣͈̫̥̙͙͚̪͓͔͇̹̬͈̟̪̲̯̼̪̗̗̩̗̹̟̝̹̮̳̙̘̞͈̖̥̣̱̩͕̣̤͓̙̹̺̞̰͖̥̥̠͇̻̝͕̺͚͓̟̼̗̥͖̤̰͍̣̘̰̩̼̞̰̱̼͕̘̙̺̺̦̫̻͉̣̭̼̖̠̰͕̗̻͉̲̼̭̠̤̩͉̭̱͕͓̲̳̫̩͍̞̖͚̩̟̥̜͈͎̦̲̥̭͖̘̼̖̥̻̠̫̗̹̰͖̩̗̳̦̗͖͙̰̗̘̙̤̰͚͎̖̫̫̪̪̖̖͈̤͚̮̣͙̱̠̼̯͇̲̣̘͍͉͈̥͓͈̺̫̣̻̪̤̜̞̙̩̺̠̦̳̹̟̥́̐̒̑̀̓̌̎̍͋̋́̀͛̉͐͊́̔̀́͐̔̈́̑͐͛̉̿͒̀͂̉̓̀̎͂͑́͑̀͋̏̓̈́̔̇̽͑̈́͋̾͂̀̓̄͒̒̈̉̔͐̾͆̍̅́́̏͛̑̇̃̅̿͒͐̈̽̅̄͗̒̑̊͗͑̿͗̂̈́̇̎͊́̔́̇̄̊͊̈́̅͌͑̂̿͒̅͋̈́̈͐̽̏̀̇͑͗͋̏̈́̂̓͊͆̈̂̔͂́̓̐͆̿͒̌̌͗̏̃̀̋͂͊̅̏̂̓͛͆̽͆̍̾̏̿͛͛̒̒͆̆̓̅͆̄͒͑̀͗̿̇͆̍̈́͛͋́̀̈́͑͛̌̆́̏̃̐̌͌͐̄̀̄͒́̾̑̃̈́͂̈̂̍́̎͋̄́̔̀͐̒̉̉͋́̓̈͌͐̆̊͊̐́̚͘̕̚͘̚̚̕͘͘͘͘̕̕̚̚͘͘̕̕̚͜͜͜͜͜͜͠͝͠͝͝͝͝͝͝͠͝ͅͅͅơ̸̡̨̨̨̡̡̨̡̢̢̢̧̡̨̨̨̧̧̨̢̨̛̛̛̛̞̖̠̪̭͇̣͕̘̼̘̲̮̜̱̥̖͚̝̝̟̫͓̦͖̦̥̻͙̖̺̞̭̮̜̖̼͙̝͈̬̰̘̠̖͎͈͖͉̞̦̩̺̜̥̳̦̫͔͍͖͈̣̬̫͉̱͙̲̗͍̲̯͍̩̗̼̺͉͖̲̟̭̗̤̩̲̲̰̝̼̫̞͖͎͖̦͎̬̱̣̹̣̬͉͎͙̳͍͇̩̯̭͔͓̬̤̲̬͉̹̻͔̜̺̙͍̺̦̦̯̣̟̘̭̼̗͇̝̤͙̞̭̤̣̭͈̜̠̮̮̘̜̹̩̟̤͚̻̺̠̲̬̮̗̻̱̞͔̲̱͙̤͓̤̣̪̭̦̤̳̲͍̬͚̰̖̭͖̳̟̗̭̻̺̟̩̱̮͔̯̭̱̣̫̟͕̞͍̥͚̺̞̖͔͈̩̲͉̰̹̻̝̠̭͕͉͖̹̲̠̝̳̹̠̹̜̤̗̥̰̲̝̜̹͍͙͉̤̠͇̄́̆͌̌̿̒̐͐̽̿̉̑̔̋̆͑̓͋̈́̏́́̈́͗̿̃́̍̍͒̈͋̌͑́̐͗̾̊͒͋̾͂̇́͋̋͋̏̈́̿͑̑̈́͑̋̂͗́̂̈́̒̓͆̈̀̂͑̋͐̉̐̒̀̃̈́͗̍̂̀͆́̽̀̿͆͊̃͊̈͐̄̽̃͒́͋̍̃̉̓͑̂̌̂͑̐̒̂͆͂͆̆̅̌͊́̎̈́̏͒͊̃̈́̏̋̓̃̿͒̎́͂͐̎͛̅̑̽̈̂̉̽̄́́̊͗̿͑̒̃͂̄̏̿̀͆͂͗̓̔̒̈́̎͛͗̇́̾̓́̏̽̌͗̈́͂̈́̑̐͐͗͌̃̄̃̈́͋͋̃̏͊͆̏͑͑̈́̄̊́̅̇̍̄͐̿̇͌̄̇̂͌̈̏͒̾̈́͌̎̌̊̀̀̓̓̾̓̏̑̈́͑̌͒̏͛̚͘͘̕͘̚͘̚͘̚̚͘̚̚̚̚̕̚̚͘͘͜͜͜͜͝͝͝͝͠͝͠͠͝͝͝͝͠͝͝ͅͅd̴̨̨̧̢̢̨̢̡̧̧̡̨̧̢̢̧̡̨̻̦̥̣̞͉̟̭̺͙̥̼̜̩̻͉̜̭͚̦̝̪͕͕̻͙͎̲̘̞͕͙̟̪̞̠̖̻͕̬̖͖̤͍͖͖̮͕͖̝̩̤̯͈͖̭͓͉͙͈̱͍̥̙̬̳̠̳̫̫̤͚̺̮̪̬͖̪̜͕̣̹͓͇̙̣̩̹̥͎̜̱͇͓͖͙͕̠̠̬͙̙̯̟̠̺̭͓̰̥̬̮̻̯̻̣͔͕̥̞̙̦̞̺͖͕̬͖̪̟̞̙̖͇̺̠̥̝̙̠̝̺͎̝̹̘̩͇̭̭̻̹͉̲͍̥̼̗̤̳̣͇̼͖̯͕̘̜̭̺̪̙̠̼̥̬̩͉̲͓͎̻̺͕͙̒̐̏̆̏̏̉̇̐̉̄̈̎̾͊͌̏̿͑̀̏̓̈́̒̀͂̈́̿͐́͂͒͐̇̿̇̒̑͆̋͑̉̓̉̓͒̀̐̈́̄̈̽͋̋̔̐́̔̔̾̉̑̅͒̾͑̏̃̓̏̈́͗̾͊͑̐̾̃̋̆̈͋͋͛̾̈́̒̐̒̃̂̑̀͗̚͘͘̕̕͘͘̚͘͜͜͜͜͜͜͜͝͝͝͠͝͠͝ͅͅͅ ẗ̸̨̨̢̨̡̡̡̢̨̢̡̧̨̡̧̧̨̡̢̡̨̨̛̛̛̛̛̛̛̼̰̬̞͎̺̮̱̦̬̲͍̪͔̪̬͈̗̻̤͉͍̖̣̙̪̱͉̳̦͖̠̝̞̯͚̞̖͉͖͍̬͈͖͔̥͖̫̘̮̣̘̺͓̼̹̺͇̹͇͖̼̣͈̫̥̙͙͚̪͓͔͇̹̬͈̟̪̲̯̼̪̗̗̩̗̹̟̝̹̮̳̙̘̞͈̖̥̣̱̩͕̣̤͓̙̹̺̞̰͖̥̥̠͇̻̝͕̺͚͓̟̼̗̥͖̤̰͍̣̘̰̩̼̞̰̱̼͕̘̙̺̺̦̫̻͉̣̭̼̖̠̰͕̗̻͉̲̼̭̠̤̩͉̭̱͕͓̲̳̫̩͍̞̖͚̩̟̥̜͈͎̦̲̥̭͖̘̼̖̥̻̠̫̗̹̰͖̩̗̳̦̗͖͙̰̗̘̙̤̰͚͎̖̫̫̪̪̖̖͈̤͚̮̣͙̱̠̼̯͇̲̣̘͍͉͈̥͓͈̺̫̣̻̪̤̜̞̙̩̺̠̦̳̹̟̥́̐̒̑̀̓̌̎̍͋̋́̀͛̉͐͊́̔̀́͐̔̈́̑͐͛̉̿͒̀͂̉̓̀̎͂͑́͑̀͋̏̓̈́̔̇̽͑̈́͋̾͂̀̓̄͒̒̈̉̔͐̾͆̍̅́́̏͛̑̇̃̅̿͒͐̈̽̅̄͗̒̑̊͗͑̿͗̂̈́̇̎͊́̔́̇̄̊͊̈́̅͌͑̂̿͒̅͋̈́̈͐̽̏̀̇͑͗͋̏̈́̂̓͊͆̈̂̔͂́̓̐͆̿͒̌̌͗̏̃̀̋͂͊̅̏̂̓͛͆̽͆̍̾̏̿͛͛̒̒͆̆̓̅͆̄͒͑̀͗̿̇͆̍̈́͛͋́̀̈́͑͛̌̆́̏̃̐̌͌͐̄̀̄͒́̾̑̃̈́͂̈̂̍́̎͋̄́̔̀͐̒̉̉͋́̓̈͌͐̆̊͊̐́̚͘̕̚͘̚̚̕͘͘͘͘̕̕̚̚͘͘̕̕̚͜͜͜͜͜͜͠͝͠͝͝͝͝͝͝͠͝ͅͅͅơ̸̡̨̨̨̡̡̨̡̢̢̢̧̡̨̨̨̧̧̨̢̨̛̛̛̛̞̖̠̪̭͇̣͕̘̼̘̲̮̜̱̥̖͚̝̝̟̫͓̦͖̦̥̻͙̖̺̞̭̮̜̖̼͙̝͈̬̰̘̠̖͎͈͖͉̞̦̩̺̜̥̳̦̫͔͍͖͈̣̬̫͉̱͙̲̗͍̲̯͍̩̗̼̺͉͖̲̟̭̗̤̩̲̲̰̝̼̫̞͖͎͖̦͎̬̱̣̹̣̬͉͎͙̳͍͇̩̯̭͔͓̬̤̲̬͉̹̻͔̜̺̙͍̺̦̦̯̣̟̘̭̼̗͇̝̤͙̞̭̤̣̭͈̜̠̮̮̘̜̹̩̟̤͚̻̺̠̲̬̮̗̻̱̞͔̲̱͙̤͓̤̣̪̭̦̤̳̲͍̬͚̰̖̭͖̳̟̗̭̻̺̟̩̱̮͔̯̭̱̣̫̟͕̞͍̥͚̺̞̖͔͈̩̲͉̰̹̻̝̠̭͕͉͖̹̲̠̝̳̹̠̹̜̤̗̥̰̲̝̜̹͍͙͉̤̠͇̄́̆͌̌̿̒̐͐̽̿̉̑̔̋̆͑̓͋̈́̏́́̈́͗̿̃́̍̍͒̈͋̌͑́̐͗̾̊͒͋̾͂̇́͋̋͋̏̈́̿͑̑̈́͑̋̂͗́̂̈́̒̓͆̈̀̂͑̋͐̉̐̒̀̃̈́͗̍̂̀͆́̽̀̿͆͊̃͊̈͐̄̽̃͒́͋̍̃̉̓͑̂̌̂͑̐̒̂͆͂͆̆̅̌͊́̎̈́̏͒͊̃̈́̏̋̓̃̿͒̎́͂͐̎͛̅̑̽̈̂̉̽̄́́̊͗̿͑̒̃͂̄̏̿̀͆͂͗̓̔̒̈́̎͛͗̇́̾̓́̏̽̌͗̈́͂̈́̑̐͐͗͌̃̄̃̈́͋͋̃̏͊͆̏͑͑̈́̄̊́̅̇̍̄͐̿̇͌̄̇̂͌̈̏͒̾̈́͌̎̌̊̀̀̓̓̾̓̏̑̈́͑̌͒̏͛̚͘͘̕͘̚͘̚͘̚̚͘̚̚̚̚̕̚̚͘͘͜͜͜͜͝͝͝͝͠͝͠͠͝͝͝͝͠͝͝ͅͅd̴̨̨̧̢̢̨̢̡̧̧̡̨̧̢̢̧̡̨̻̦̥̣̞͉̟̭̺͙̥̼̜̩̻͉̜̭͚̦̝̪͕͕̻͙͎̲̘̞͕͙̟̪̞̠̖̻͕̬̖͖̤͍͖͖̮͕͖̝̩̤̯͈͖̭͓͉͙͈̱͍̥̙̬̳̠̳̫̫̤͚̺̮̪̬͖̪̜͕̣̹͓͇̙̣̩̹̥͎̜̱͇͓͖͙͕̠̠̬͙̙̯̟̠̺̭͓̰̥̬̮̻̯̻̣͔͕̥̞̙̦̞̺͖͕̬͖̪̟̞̙̖͇̺̠̥̝̙̠̝̺͎̝̹̘̩͇̭̭̻̹͉̲͍̥̼̗̤̳̣͇̼͖̯͕̘̜̭̺̪̙̠̼̥̬̩͉̲͓͎̻̺͕͙̒̐̏̆̏̏̉̇̐̉̄̈̎̾͊͌̏̿͑̀̏̓̈́̒̀͂̈́̿͐́͂͒͐̇̿̇̒̑͆̋͑̉̓̉̓͒̀̐̈́̄̈̽͋̋̔̐́̔̔̾̉̑̅͒̾͑̏̃̓̏̈́͗̾͊͑̐̾̃̋̆̈͋͋͛̾̈́̒̐̒̃̂̑̀͗̚͘͘̕̕͘͘̚͘͜͜͜͜͜͜͜͝͝͝͠͝͠͝ͅͅͅ ẗ̸̨̨̢̨̡̡̡̢̨̢̡̧̨̡̧̧̨̡̢̡̨̨̛̛̛̛̛̛̛̼̰̬̞͎̺̮̱̦̬̲͍̪͔̪̬͈̗̻̤͉͍̖̣̙̪̱͉̳̦͖̠̝̞̯͚̞̖͉͖͍̬͈͖͔̥͖̫̘̮̣̘̺͓̼̹̺͇̹͇͖̼̣͈̫̥̙͙͚̪͓͔͇̹̬͈̟̪̲̯̼̪̗̗̩̗̹̟̝̹̮̳̙̘̞͈̖̥̣̱̩͕̣̤͓̙̹̺̞̰͖̥̥̠͇̻̝͕̺͚͓̟̼̗̥͖̤̰͍̣̘̰̩̼̞̰̱̼͕̘̙̺̺̦̫̻͉̣̭̼̖̠̰͕̗̻͉̲̼̭̠̤̩͉̭̱͕͓̲̳̫̩͍̞̖͚̩̟̥̜͈͎̦̲̥̭͖̘̼̖̥̻̠̫̗̹̰͖̩̗̳̦̗͖͙̰̗̘̙̤̰͚͎̖̫̫̪̪̖̖͈̤͚̮̣͙̱̠̼̯͇̲̣̘͍͉͈̥͓͈̺̫̣̻̪̤̜̞̙̩̺̠̦̳̹̟̥́̐̒̑̀̓̌̎̍͋̋́̀͛̉͐͊́̔̀́͐̔̈́̑͐͛̉̿͒̀͂̉̓̀̎͂͑́͑̀͋̏̓̈́̔̇̽͑̈́͋̾͂̀̓̄͒̒̈̉̔͐̾͆̍̅́́̏͛̑̇̃̅̿͒͐̈̽̅̄͗̒̑̊͗͑̿͗̂̈́̇̎͊́̔́̇̄̊͊̈́̅͌͑̂̿͒̅͋̈́̈͐̽̏̀̇͑͗͋̏̈́̂̓͊͆̈̂̔͂́̓̐͆̿͒̌̌͗̏̃̀̋͂͊̅̏̂̓͛͆̽͆̍̾̏̿͛͛̒̒͆̆̓̅͆̄͒͑̀͗̿̇͆̍̈́͛͋́̀̈́͑͛̌̆́̏̃̐̌͌͐̄̀̄͒́̾̑̃̈́͂̈̂̍́̎͋̄́̔̀͐̒̉̉͋́̓̈͌͐̆̊͊̐́̚͘̕̚͘̚̚̕͘͘͘͘̕̕̚̚͘͘̕̕̚͜͜͜͜͜͜͠͝͠͝͝͝͝͝͝͠͝ͅͅͅơ̸̡̨̨̨̡̡̨̡̢̢̢̧̡̨̨̨̧̧̨̢̨̛̛̛̛̞̖̠̪̭͇̣͕̘̼̘̲̮̜̱̥̖͚̝̝̟̫͓̦͖̦̥̻͙̖̺̞̭̮̜̖̼͙̝͈̬̰̘̠̖͎͈͖͉̞̦̩̺̜̥̳̦̫͔͍͖͈̣̬̫͉̱͙̲̗͍̲̯͍̩̗̼̺͉͖̲̟̭̗̤̩̲̲̰̝̼̫̞͖͎͖̦͎̬̱̣̹̣̬͉͎͙̳͍͇̩̯̭͔͓̬̤̲̬͉̹̻͔̜̺̙͍̺̦̦̯̣̟̘̭̼̗͇̝̤͙̞̭̤̣̭͈̜̠̮̮̘̜̹̩̟̤͚̻̺̠̲̬̮̗̻̱̞͔̲̱͙̤͓̤̣̪̭̦̤̳̲͍̬͚̰̖̭͖̳̟̗̭̻̺̟̩̱̮͔̯̭̱̣̫̟͕̞͍̥͚̺̞̖͔͈̩̲͉̰̹̻̝̠̭͕͉͖̹̲̠̝̳̹̠̹̜̤̗̥̰̲̝̜̹͍͙͉̤̠͇̄́̆͌̌̿̒̐͐̽̿̉̑̔̋̆͑̓͋̈́̏́́̈́͗̿̃́̍̍͒̈͋̌͑́̐͗̾̊͒͋̾͂̇́͋̋͋̏̈́̿͑̑̈́͑̋̂͗́̂̈́̒̓͆̈̀̂͑̋͐̉̐̒̀̃̈́͗̍̂̀͆́̽̀̿͆͊̃͊̈͐̄̽̃͒́͋̍̃̉̓͑̂̌̂͑̐̒̂͆͂͆̆̅̌͊́̎̈́̏͒͊̃̈́̏̋̓̃̿͒̎́͂͐̎͛̅̑̽̈̂̉̽̄́́̊͗̿͑̒̃͂̄̏̿̀͆͂͗̓̔̒̈́̎͛͗̇́̾̓́̏̽̌͗̈́͂̈́̑̐͐͗͌̃̄̃̈́͋͋̃̏͊͆̏͑͑̈́̄̊́̅̇̍̄͐̿̇͌̄̇̂͌̈̏͒̾̈́͌̎̌̊̀̀̓̓̾̓̏̑̈́͑̌͒̏͛̚͘͘̕͘̚͘̚͘̚̚͘̚̚̚̚̕̚̚͘͘͜͜͜͜͝͝͝͝͠͝͠͠͝͝͝͝͠͝͝ͅͅd̴̨̨̧̢̢̨̢̡̧̧̡̨̧̢̢̧̡̨̻̦̥̣̞͉̟̭̺͙̥̼̜̩̻͉̜̭͚̦̝̪͕͕̻͙͎̲̘̞͕͙̟̪̞̠̖̻͕̬̖͖̤͍͖͖̮͕͖̝̩̤̯͈͖̭͓͉͙͈̱͍̥̙̬̳̠̳̫̫̤͚̺̮̪̬͖̪̜͕̣̹͓͇̙̣̩̹̥͎̜̱͇͓͖͙͕̠̠̬͙̙̯̟̠̺̭͓̰̥̬̮̻̯̻̣͔͕̥̞̙̦̞̺͖͕̬͖̪̟̞̙̖͇̺̠̥̝̙̠̝̺͎̝̹̘̩͇̭̭̻̹͉̲͍̥̼̗̤̳̣͇̼͖̯͕̘̜̭̺̪̙̠̼̥̬̩͉̲͓͎̻̺͕͙̒̐̏̆̏̏̉̇̐̉̄̈̎̾͊͌̏̿͑̀̏̓̈́̒̀͂̈́̿͐́͂͒͐̇̿̇̒̑͆̋͑̉̓̉̓͒̀̐̈́̄̈̽͋̋̔̐́̔̔̾̉̑̅͒̾͑̏̃̓̏̈́͗̾͊͑̐̾̃̋̆̈͋͋͛̾̈́̒̐̒̃̂̑̀͗̚͘͘̕̕͘͘̚͘͜͜͜͜͜͜͜͝͝͝͠͝͠͝ͅͅͅ ẗ̸̨̨̢̨̡̡̡̢̨̢̡̧̨̡̧̧̨̡̢̡̨̨̛̛̛̛̛̛̛̼̰̬̞͎̺̮̱̦̬̲͍̪͔̪̬͈̗̻̤͉͍̖̣̙̪̱͉̳̦͖̠̝̞̯͚̞̖͉͖͍̬͈͖͔̥͖̫̘̮̣̘̺͓̼̹̺͇̹͇͖̼̣͈̫̥̙͙͚̪͓͔͇̹̬͈̟̪̲̯̼̪̗̗̩̗̹̟̝̹̮̳̙̘̞͈̖̥̣̱̩͕̣̤͓̙̹̺̞̰͖̥̥̠͇̻̝͕̺͚͓̟̼̗̥͖̤̰͍̣̘̰̩̼̞̰̱̼͕̘̙̺̺̦̫̻͉̣̭̼̖̠̰͕̗̻͉̲̼̭̠̤̩͉̭̱͕͓̲̳̫̩͍̞̖͚̩̟̥̜͈͎̦̲̥̭͖̘̼̖̥̻̠̫̗̹̰͖̩̗̳̦̗͖͙̰̗̘̙̤̰͚͎̖̫̫̪̪̖̖͈̤͚̮̣͙̱̠̼̯͇̲̣̘͍͉͈̥͓͈̺̫̣̻̪̤̜̞̙̩̺̠̦̳̹̟̥́̐̒̑̀̓̌̎̍͋̋́̀͛̉͐͊́̔̀́͐̔̈́̑͐͛̉̿͒̀͂̉̓̀̎͂͑́͑̀͋̏̓̈́̔̇̽͑̈́͋̾͂̀̓̄͒̒̈̉̔͐̾͆̍̅́́̏͛̑̇̃̅̿͒͐̈̽̅̄͗̒̑̊͗͑̿͗̂̈́̇̎͊́̔́̇̄̊͊̈́̅͌͑̂̿͒̅͋̈́̈͐̽̏̀̇͑͗͋̏̈́̂̓͊͆̈̂̔͂́̓̐͆̿͒̌̌͗̏̃̀̋͂͊̅̏̂̓͛͆̽͆̍̾̏̿͛͛̒̒͆̆̓̅͆̄͒͑̀͗̿̇͆̍̈́͛͋́̀̈́͑͛̌̆́̏̃̐̌͌͐̄̀̄͒́̾̑̃̈́͂̈̂̍́̎͋̄́̔̀͐̒̉̉͋́̓̈͌͐̆̊͊̐́̚͘̕̚͘̚̚̕͘͘͘͘̕̕̚̚͘͘̕̕̚͜͜͜͜͜͜͠͝͠͝͝͝͝͝͝͠͝ͅͅͅơ̸̡̨̨̨̡̡̨̡̢̢̢̧̡̨̨̨̧̧̨̢̨̛̛̛̛̞̖̠̪̭͇̣͕̘̼̘̲̮̜̱̥̖͚̝̝̟̫͓̦͖̦̥̻͙̖̺̞̭̮̜̖̼͙̝͈̬̰̘̠̖͎͈͖͉̞̦̩̺̜̥̳̦̫͔͍͖͈̣̬̫͉̱͙̲̗͍̲̯͍̩̗̼̺͉͖̲̟̭̗̤̩̲̲̰̝̼̫̞͖͎͖̦͎̬̱̣̹̣̬͉͎͙̳͍͇̩̯̭͔͓̬̤̲̬͉̹̻͔̜̺̙͍̺̦̦̯̣̟̘̭̼̗͇̝̤͙̞̭̤̣̭͈̜̠̮̮̘̜̹̩̟̤͚̻̺̠̲̬̮̗̻̱̞͔̲̱͙̤͓̤̣̪̭̦̤̳̲͍̬͚̰̖̭͖̳̟̗̭̻̺̟̩̱̮͔̯̭̱̣̫̟͕̞͍̥͚̺̞̖͔͈̩̲͉̰̹̻̝̠̭͕͉͖̹̲̠̝̳̹̠̹̜̤̗̥̰̲̝̜̹͍͙͉̤̠͇̄́̆͌̌̿̒̐͐̽̿̉̑̔̋̆͑̓͋̈́̏́́̈́͗̿̃́̍̍͒̈͋̌͑́̐͗̾̊͒͋̾͂̇́͋̋͋̏̈́̿͑̑̈́͑̋̂͗́̂̈́̒̓͆̈̀̂͑̋͐̉̐̒̀̃̈́͗̍̂̀͆́̽̀̿͆͊̃͊̈͐̄̽̃͒́͋̍̃̉̓͑̂̌̂͑̐̒̂͆͂͆̆̅̌͊́̎̈́̏͒͊̃̈́̏̋̓̃̿͒̎́͂͐̎͛̅̑̽̈̂̉̽̄́́̊͗̿͑̒̃͂̄̏̿̀͆͂͗̓̔̒̈́̎͛͗̇́̾̓́̏̽̌͗̈́͂̈́̑̐͐͗͌̃̄̃̈́͋͋̃̏͊͆̏͑͑̈́̄̊́̅̇̍̄͐̿̇͌̄̇̂͌̈̏͒̾̈́͌̎̌̊̀̀̓̓̾̓̏̑̈́͑̌͒̏͛̚͘͘̕͘̚͘̚͘̚̚͘̚̚̚̚̕̚̚͘͘͜͜͜͜͝͝͝͝͠͝͠͠͝͝͝͝͠͝͝ͅͅd̴̨̨̧̢̢̨̢̡̧̧̡̨̧̢̢̧̡̨̻̦̥̣̞͉̟̭̺͙̥̼̜̩̻͉̜̭͚̦̝̪͕͕̻͙͎̲̘̞͕͙̟̪̞̠̖̻͕̬̖͖̤͍͖͖̮͕͖̝̩̤̯͈͖̭͓͉͙͈̱͍̥̙̬̳̠̳̫̫̤͚̺̮̪̬͖̪̜͕̣̹͓͇̙̣̩̹̥͎̜̱͇͓͖͙͕̠̠̬͙̙̯̟̠̺̭͓̰̥̬̮̻̯̻̣͔͕̥̞̙̦̞̺͖͕̬͖̪̟̞̙̖͇̺̠̥̝̙̠̝̺͎̝̹̘̩͇̭̭̻̹͉̲͍̥̼̗̤̳̣͇̼͖̯͕̘̜̭̺̪̙̠̼̥̬̩͉̲͓͎̻̺͕͙̒̐̏̆̏̏̉̇̐̉̄̈̎̾͊͌̏̿͑̀̏̓̈́̒̀͂̈́̿͐́͂͒͐̇̿̇̒̑͆̋͑̉̓̉̓͒̀̐̈́̄̈̽͋̋̔̐́̔̔̾̉̑̅͒̾͑̏̃̓̏̈́͗̾͊͑̐̾̃̋̆̈͋͋͛̾̈́̒̐̒̃̂̑̀͗̚͘͘̕̕͘͘̚͘͜͜͜͜͜͜͜͝͝͝͠͝͠͝ͅͅͅ ⛧⛧", false, 3);
            Greenfoot.delay(100);
            Rob.stopSaying();
            Greenfoot.delay(200);
            Tod.say("I should really\nget this door open\nbefore the snickers\nwears off...", true, 0);
            playMusic();
            scene=3;
        }
    }
    
    private void drawMaterials(){
        addObject(text, 0, 0);
    }
    
    private void drawButtons(){
        cyberpunkDoor.scale(0.2);
        addObject(cyberpunkDoor, MIDDLE+110, MIDDLE+170);
    }
    
    private void drawActors(){
        
    }
    
    private void drawBackground(){
        GreenfootImage background = new GreenfootImage("cyberpunkcity2.png");
        background.scale(1080, 1080);
        setBackground(background);
    }
    }
